<template>
  <div id="mainContent">
    <site-header/>
    <navigation/>

    <!-- Main Content -->
    <section class="page-section clearfix">
      <div class="container">
        <div class="intro">
          <img class="intro-img img-fluid mb-3 mb-lg-0 rounded" src="img/intro.jpg" alt="">
          <div class="intro-text left-0 text-center bg-faded p-5 rounded">
            <h2 class="section-heading mb-4">
              <span class="section-heading-upper">Fresh Coffee</span>
              <span class="section-heading-lower">Добро пожаловать</span>
            </h2>
            <p class="mb-3">Создаваемые с помощью растений и всевозможных материалов композиции позволяют передавать настроение автора, дают возможность донести до окружающих какие-то его идеи, мысли, фантазии, подобно художественным полотнам или музыкальным произведениям.
            </p>
            <div class="intro-button mx-auto">
              <a class="btn btn-primary btn-xl" href="#">Читать!</a>
            </div>
          </div>
        </div>
      </div>
    </section>

    <section class="page-section cta">
      <div class="container">
        <div class="row">
          <div class="col-xl-9 mx-auto">
            <div class="cta-inner text-center rounded">
              <h2 class="section-heading mb-4">
                <span class="section-heading-upper">Our Promise</span>
                <span class="section-heading-lower">To You</span>
              </h2>
              <p class="mb-0">Кто и когда впервые поставил в своей пещере первый букет, или посадил первое растение «просто так» — для красоты, а не для еды в своем жилище, не возьмется предположить ни один историк.
                А ведь именно тогда и были заложены основы фитодизайна. Ныне нам известны древнеегипетские рисунки или рельефы на стенах гробниц или храмов, описания уютных вегетариумов или прекрасных внутридворовых садов с фонтанами в древнеримских летописях или древнекитайских литературных источниках, изображения различных горшечных растений в интерьерах на картинах. А одно из семи чудес света — висячие сады Семирамиды — что как не шедевр искусства фитодизайна?
                Сейчас возможность украсить свое жилище самыми разнообразными, в том числе и экзотическими растениями, может позволить себе практически каждый. Уже нет необходимости снаряжать за ними экспедиции «на край света», каждый желающий может сам создавать прекрасные живые шедевры в пределах обычной городской квартиры. За последние десять-двадцать лет цветочный бизнес в России совершил невероятный скачок от «гвоздик к 7 ноября и мимозы на 8 марта» до головокружительного многообразия горшечных растений, срезанных цветов, всевозможных аксессуаров, контейнеров, грунтов, удобрений, средств защиты и прочее, прочее, прочее. Услуги по упаковке и доставке цветов — это уже почти обязательный минимум.

              </p>
              <img src="/uploads/collage_flowers.png" width="600px"/>
              <p class="mb-0">
                Многие фирмы предлагают услуги по составлению дизайн-проектов, созданию зимних садов и горшечных композиций и регулярному обслуживанию растений. Клиенту остается только «пребывать в нирване» наслаждаясь созданным персонально для него уголком рая.
              </p>
              <p class="mb-0">
                Но творить и создавать красоту собственными руками — ни с чем не сравнимое удовольствие. Но сперва необходимо познакомиться с основными принципами фитодизайна. Вот некоторые из них:
              </p>
              <p class="mb-0">
                -Для интерьера, выдержанного в классическом стиле, подойдут композиции с характерной пирамидальной формой — широкие у основания и сужающиеся вверху.
              </p>
              <p class="mb-0">
                — Романтические нотки в дизайн помещения добавят растения с нежными плавными формами побегов и листьев, мягкими цветовыми сочетаниями, изящными неяркими цветами, например, бегонии.
              </p>
              <img src="/uploads/200x200x1_kot.png" width="200px"/>
              <p class="mb-0">
                Бескрайний простор для торчества — декорирование цветочных емкостей. Немного фантазии и терпения — и обычный глиняный горшок превращается в произведение прикладного искусства. Вам не придется сбивать ноги в поисках «такого же только с перламутровыми пуговичками». Техник декорирования известно превеликое множество. С их помощью вы можете создавать сколько угодно, каких угодно емкостей на ваш вкус и под ваш интерьер.
              </p>
              <img src="/uploads/200x200_footer.png" width="200px"/>
              <p class="mb-0">
                Не забывайте и про «живые букеты». Эти прекрасные цветущие растения, которые в последние годы все чаще дарят вместо обычных срезанных цветов, обычно продаются в совершенно непрезентабельных транспортировочных горшках. Поставить такое «произведение», например, на праздничный стол вы вряд ли захотите. Для подобных случаев лучше приобрести несколько симпатичных кашпо, подходящих к оформлению торжества.
              </p>
            </div>
          </div>
        </div>
      </div>
    </section>

    <site-footer/>
  </div>
</template>

<script>
import Navigation from '~/components/Navigation.vue'
import SiteFooter from '~/components/SiteFooter.vue'
import SiteHeader from '~/components/SiteHeader.vue'

export default {
  components: {
    Navigation,
    SiteFooter,
    SiteHeader
  },
  computed: {
    posts () {
      return this.$store.state.posts
    }
  }
}
</script>
